In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('name.csv')

In [3]:
type(df)

pandas.core.frame.DataFrame

In [4]:
df

     name              email  address  pincode surname
0   vijit   viji34@gmail.com  lucknow   226001   kumar
1  monika   monu23@gmail.com  lucknow   226002     pal
2   payal  payal45@gmail.com    delhi    56543     pal

In [5]:
df.dtypes

name       object
email      object
address    object
pincode     int64
surname    object
dtype: object

In [6]:
df.head()

     name              email  address  pincode surname
0   vijit   viji34@gmail.com  lucknow   226001   kumar
1  monika   monu23@gmail.com  lucknow   226002     pal
2   payal  payal45@gmail.com    delhi    56543     pal

In [7]:
df.columns

Index(['name', 'email', 'address', 'pincode', 'surname'], dtype='object')

In [8]:
type(df[['name', 'email', 'address']])

pandas.core.frame.DataFrame

In [ ]:
df1 =pd.read_html('https://www.basketball-reference.com/leagues/NBA_2015_totals.html')